[
  {"createdAt":"2021-12-28T20:54:37.691Z","name":"JavaScript","Short_description":"JavaScript, often abbreviated JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS","Description":"JavaScript (/ˈdʒɑːvəˌskrɪpt/),[10] often abbreviated JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS.[11] Over 97% of websites use JavaScript on the client side for web page behavior,[12] often incorporating third-party libraries.[13] All major web browsers have a dedicated JavaScript engine to execute the code on users' devices.","Image":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/1920px-Unofficial_JavaScript_logo_2.svg.png","id":"1"},
  {"createdAt":"2021-12-29T13:58:57.616Z","name":"Python","Short_description":"Python is an interpreted high-level general-purpose programming language. Its design philosophy emphasizes code readability with its use of significant indentation.","Description":"Python is an interpreted high-level general-purpose programming language. Its design philosophy emphasizes code readability with its use of significant indentation. Its language constructs as well as its object-oriented approach aim to help programmers write clear, logical code for small and large-scale projects.","Image":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Python-logo-notext.svg/1920px-Python-logo-notext.svg.png","id":"2"},
  {"createdAt":"2021-12-29T15:07:57.479Z","name":"PHP","Short_description":"PHP is a general-purpose scripting language geared towards web development.","Description":"PHP is a general-purpose scripting language geared towards web development.[7] It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1994.[8] The PHP reference implementation is now produced by The PHP Group.[9] PHP originally stood for Personal Home Page,[8] but it now stands for the recursive initialism PHP: Hypertext Preprocessor.","Image":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/PHP-logo.svg/2880px-PHP-logo.svg.png","id":"3"},
  {"createdAt":"2021-12-29T01:12:41.711Z","name":"C","Short_description":"C is a general-purpose, procedural computer programming language supporting structured programming, lexical variable scope, and recursion, with a static type system.","Description":"C is a general-purpose, procedural computer programming language supporting structured programming, lexical variable scope, and recursion, with a static type system. By design, C provides constructs that map efficiently to typical machine instructions.","Image":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/The_C_Programming_Language_logo.svg/1920px-The_C_Programming_Language_logo.svg.png","id":"4"},
  {"createdAt":"2021-12-29T13:34:41.009Z","name":"ReactJS","Short_description":"React is a free and open-source front-end JavaScript library for building user interfaces based on UI components","Description":"React is a free and open-source front-end JavaScript library for building user interfaces based on UI components. It is maintained by Meta and a community of individual developers and companies. React can be used as a base in the development of single-page or mobile applications.","Image":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/React-icon.svg/2560px-React-icon.svg.png","id":"5"},
  {"createdAt":"2021-12-29T06:01:52.610Z","name":"Django","Short_description":"Django is a Python-based free and open-source web framework that follows the model–template–views architectural pattern.","Description":"Django is a Python-based free and open-source web framework that follows the model–template–views architectural pattern. It is maintained by the Django Software Foundation, an independent organization established in the US as a 501 non-profit","Image":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Django_logo.svg/2880px-Django_logo.svg.png","id":"6"}
]
